Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: He shall make or have made all adjustments to the documentation which may come to be needed, having regard to the manner in which the work progresses and to any changes which have occurred during the construction phase.
sv: Han ska genomföra eller låta genomföra alla anpassningar i dokumentationen som kan komma att behövas med hänsyn till hur arbetet fortskrider och till de eventuella förändringar som ägt rum under byggskedet.

source: He shall preserve the documentation for the lifetime of the object.
sv: Han ska förvara dokumentationen så länge som objektet består.

source: If the object is disposed of, the documentation shall be transferred to the new tenant or owner.
sv: Om objektet överlåts ska dokumentationen överlämnas till den nya innehavaren.

source: Responsibilities of certain other parties with safety responsibilities during planning, design and project preparation
sv: Ansvar för vissa andra skyddsansvariga under planeringen och projekteringen

source: Section 10 a
sv: (AFS 2008:16)

source: The manufacturer of prefabricated buildings or structures shall in the course of the design comply with the relevant stipulations of Section 5.
sv: a § Den som tillverkar monteringsfärdiga byggnader eller anläggningar ska vid projekteringen i tillämpliga delar följa bestämmelserna i 5 §.

source: Responsibilities of a building work environment co-ordinator appointed for planning and design
sv: Ansvar för byggarbetsmiljösamordnare som utsetts för planering och projektering

source: The building work environment co-ordinator as referred to in Chap. 3, Section 7a of the Work Environment Act shall participate in the planning and in the direction of the design.
sv: § Byggarbetsmiljösamordnare enligt 3 kap. 7 a § arbetsmiljölagen ska delta i planeringen och i ledningen av projekteringen.

source: He shall co-ordinate the planning and the design with respect to the work environment, in such a way that the parties involved in the planning and design take account of each other’s planning and solutions.
sv: Han ska samordna planeringen och projekteringen med avseende på arbetsmiljön, så att de som medverkar vid planeringen och projekteringen tar hänsyn till varandras planer och lösningar.

source: This shall be done in the manner necessary for the avoidance of risks of ill- health and accidents during the execution of the building or civil engineering work.
sv: Detta ska göras på det sätt som behövs för att förebygga risker för ohälsa och olycksfall under utförandet av byggnads- eller anläggningsarbetet.

source: The co-ordination shall also lead to the execution of different parts of the project and of structures, installations and suchlike not coinciding in time and space during the project execution stage in such a way as to entail a risk of ill-health or accidents.
sv: Samordningen ska också leda till att utförandet av olika delar av projektet samt av konstruktioner, installationer och liknande inte sammanfaller i tid och rum under byggskedet på ett sådant sätt att risk för ohälsa eller olycksfall uppkommer.

source: If the building work environment co-ordinator as referred to in Chap. 3, Section 7 a of the Work Environment Act has failed to compile or procure the compilation of a work environment plan before the setting up of the construction site, in contravention of the requirements of this section, this party shall pay a sanction charge of
sv: Om byggarbetsmiljösamordnaren enligt 3 kap. 7 a § arbetsmiljölagen i strid med denna bestämmelse inte har upprättat eller låtit upprätta en arbetsmiljöplan innan byggarbetsplatsen etablerats ska denne betala sanktionsavgift om

source: •SEK 50 000 if the size of the project is such that prior notification is required under Section 7 of these provisions,
sv: 50 000 kronor om projektets storlek är sådan att förhandsanmälan krävs enligt 7 § i dessa föreskrifter,

source: •SEK 10 000 if the size of the project is such that prior notification is not required under Section 7 of these provisions.
sv: 10 000 kronor om projektets storlek är sådan att förhandsanmälan inte krävs enligt 7 § i dessa föreskrifter.

source: Section 12 a
sv: (AFS 2014:26)

source: The work environment plan (safety and health plan) shall always include the points indicated in A and B, below.
sv: 12 a § Arbetsmiljöplanen ska alltid innehålla vad som anges i A och B nedan.

source: Thus the work environment plan shall contain the following.
sv: Arbetsmiljöplanen ska alltså innehålla följande:

source: The rules to be applied on the construction site.
sv: De regler som ska tillämpas på byggarbetsplatsen.

source: A description of how health and safety work shall be organised.
sv: En beskrivning av hur arbetsmiljöarbetet ska organiseras.

source: When works as per 1-13, below, are involved: a description of the special measures to be taken during the construction phase in order for the work environment to meet the requirements of the Work Environment Act and its stipulations, as well as these Provisions and the other Provisions issued by the National Board of Occupational Safety and Health or the Work Environment Authority by authority of the Work Environment Ordinance and applicable to the work.
sv: När arbeten enligt 1–13 nedan är aktuella: En beskrivning av de särskilda åtgärder som ska vidtas under byggskedet för att arbetsmiljön ska kunna uppfylla kraven i arbetsmiljölagen och dessa föreskrifter samt de andra föreskrifter som Arbetarskyddsstyrelsen eller Arbetsmiljöverket meddelat med stöd av arbetsmiljöförordningen och som är tillämpliga på arbetet.

source: Work entailing a risk of falls to a lower level where the difference in level is two metres or more.
sv: Arbete med risk för fall till lägre nivå där nivåskillnaden är två meter eller mer.

source: Work entailing a risk of burial under earth falls or engulfment in loose soil.
sv: Arbete som innebär risk att begravas under jordmassor eller sjunka ned i lös mark.

source: Work with chemical or biological substances constituting a particular danger to safety and health or, according to Provisions issued by the National Board of Occupational Safety and Health or the
sv: Arbete med sådana kemiska eller biologiska ämnen som medför särskild fara för hälsa och säkerhet eller som enligt Arbetarskyddsstyrelsens eller Arbetsmiljöverkets föreskrifter omfattas av krav på medicinsk kontroll.

source: Work near high voltage power lines.
sv: Arbete i närheten av högspänningsledningar.

source: Work entailing the risk of drowning.
sv: Arbete som medför drunkningsrisk.

source: Work on wells and tunnels and on underground works.
sv: Arbete i brunnar och tunnlar samt anläggningsarbete under jord.

source: Work carried out underwater with diving equipment.
sv: Arbete som utförs under vatten med dykarutrustning.

source: Work carried out in a caisson with a compressed-air atmosphere.
sv: Arbete som utförs i kassun under förhöjt lufttryck.

source: Work involving the use of explosives.
sv: Arbete vid vilket sprängämnen används.

source: Work involving the launching, assembly and dismantling of heavy prefabricated components or heavy shuttering elements.
sv: Arbete vid vilket lansering, montering och nedmontering av tunga byggelement eller tunga formbyggnadselement ingår.

source: Work in a place or area with passing vehicular traffic.
sv: Arbete på plats eller område med passerande fordonstrafik.

source: Demolition of load-bearing structures or health-endangering materials or substances.
sv: Rivning av bärande konstruktioner eller hälsofarliga material eller ämnen.

source: If the work is to be carried out on a site where other activity will be in progress simultaneously, account shall be taken of this in the plan.
sv: Om arbetet ska utföras på en plats där annan verksamhet kommer att pågå samtidigt ska detta beaktas i planen.

source: Section 12 b
sv: (AFS 2008:16)

source: The building work environment co-ordinator as referred to in Chap. 3, Section 7a of the Work Environment Act shall compile the documentation referred to in Section 9.
sv: b § Byggarbetsmiljösamordnare enligt 3 kap. 7 a § arbetsmiljölagen ska utarbeta den dokumentation som anges i 9 §.

source: The documentation shall be completed when the works have been concluded.
sv: Dokumentationen ska vara färdigställd då arbetena avslutats.

source: It shall describe the structure and design of the object and the building products used, in all respects to the extent of importance for safety and health in connection with work on the operation, maintenance, repair, alternation and demolition of the object.
sv: Den ska beskriva objektets konstruktion och utformning samt de byggprodukter som använts, allt i den omfattning som är av betydelse för säkerhet och hälsa vid arbete med drift, underhåll, reparation, ändring och rivning av objektet.

source: Responsibilities of building work environment co-ordinators for the execution of building or civil engineering work
sv: Ansvar för byggarbetsmiljösamordnare under utförandet av ett byggnads- eller anläggningsarbete

source: A building work environment co-ordinator as referred to in Chap. 3, Section 7 b of the Work Environment Act shall organise safety activities on the construction site.
sv: § Byggarbetsmiljösamordnare enligt 3 kap. 7 b § arbetsmiljölagen ska organisera en skyddsverksamhet på byggarbetsplatsen.

source: If two or more undertakings are engaged in activities on the construction site, he shall organise joint safety activities together with them.
sv: Om flera företag bedriver verksamhet på byggarbetsplatsen ska byggarbetsmiljösamordnaren organisera en gemensam skyddsverksamhet tillsammans med dem.

source: A building work environment co-ordinator as referred to in Chap. 3, section 7 b of the Work Environment Act shall see to it that the work environment plan (safety and health plan), drawn up according to Sections 8, 12 and 12 a, is kept available on the construction site so that everyone working there can view it as soon as the construction site is set up.
sv: Byggarbetsmiljösamordnare enligt 3 kap. 7 b § arbetsmiljölagen ska se till att den arbetsmiljöplan som upprättats enligt 8, 12 och 12 a §§ finns tillgänglig på byggarbetsplatsen, så att alla som arbetar där kan ta del av den, så snart byggarbetsplatsen etablerats.

source: A building work environment co-ordinator as referred to in Chap. 3, Section 7 b of the Work Environment Act shall make or have made all adjustments to the work environment plan which may be needed, having regard to the manner in which the work progresses and to any changes which have occurred.
sv: Byggarbetsmiljösamordnare enligt 3 kap. 7 b § arbetsmiljölagen ska genomföra eller låta genomföra alla anpassningar i arbetsmiljöplanen som kan komma att behövas med hänsyn till hur arbetet fortskrider och till de eventuella förändringar som ägt rum.

source: In doing so the building work environment co-ordinator shall adapt the plan to the working methods actually used and to the actual conditions governing the conduct of the work.
sv: Byggarbetsmiljösamordnaren ska därvid anpassa planen till de arbetsmetoder som verkligen används och till de verkliga förutsättningarna för arbetets utförande.

source: The description of how health and safety work shall be organised must also be kept up to date.
sv: hur arbetsmiljöarbetet ska organiseras ska vara uppdaterad.

source: A fresh adjustment is to be made in connection with all significant changes in the conduct of the work or changed conditions with a bearing on the work environment.
sv: Vid alla ändringar i arbetets utförande av betydelse eller ändrade förutsättningar av betydelse för arbetsmiljön, ska en ny anpassning göras.

source: A building work environment co-ordinator as referred to in Chap. 3, Section 7 b of the Work Environment Act shall make or have made all adjustments to the documentation referred to in Section 12 b which may be needed, having regard to the manner in which the work progresses and to any changes which have occurred.
sv: Byggarbetsmiljösamordnare enligt 3 kap. 7 b § arbetsmiljölagen ska genomföra eller låta genomföra alla anpassningar i dokumentationen enligt 12 b §, som kan komma att krävas med hänsyn till hur arbetet fortskrider och de eventuella förändringar som ägt rum.

source: If the building work environment co-ordinator as referred to in Chap. 3, Section 7 b of the Work Environment Act fails to ensure that the work environment plan, drawn up according to Sections 8, 12 and 12 a, is kept available on the construction site so that everyone working there can view it, in contravention of the requirements of the second paragraph of this section, this party shall pay a sanction charge of
sv: Om den som är byggarbetsmiljösamordnare enligt 3 kap. 7 b § arbetsmiljölagen i strid med kraven i andra stycket inte ser till att den arbetsmiljöplan som upprättats enligt 8, 12 och 12 a §§ finns tillgänglig på byggarbetsplatsen, så att alla som arbetar där kan ta del av den, ska denne betala sanktionsavgift om

source: A building work environment co-ordinator as referred to in Chap. 3, Section 7 b of the Work Environment Act shall supervise measures to verify that technical devices are duly inspected and tested and also that drivers of such devices have sufficient competence or, where applicable, the requisite permits.
sv: § Byggarbetsmiljösamordnare enligt 3 kap. 7 b § arbetsmiljölagen ska ha överinseende över kontrollen dels av att tekniska anordningar är behörigen besiktigade och provade, dels av att förare av sådana anordningar har tillräcklig kompetens eller, i förekommande fall, erforderliga tillstånd.

source: When no representative of the building work environment co-ordinator is available at the construction site, the building work environment co-ordina- tor shall see to it that particulars are available concerning whom to turn to.
sv: § När någon företrädare för byggarbetsmiljösamordnaren inte finns tillgänglig på byggarbetsplatsen, ska byggarbetsmiljösamordnaren se till att uppgift finns om vart man kan vända sig.

source: There shall be one or more contact persons, as the situation demands, and particulars shall be furnished as to how one of them can be contacted at any time when work is in progress.
sv: En kontaktperson eller, om det behövs, flera kontaktpersoner ska finnas, liksom uppgift om hur man får tag på någon av dem vid alla tidpunkter när arbete pågår.

source: Co-ordination responsibilities of other undertakings at the construction site
sv: Ansvar för övriga företag på byggarbetsplatsen beträffande samordningen

source: The party carrying on activity at the construction site shall furnish the building work environment co-ordinator as referred to in Chap. 3, Section 7 b of the Work Environment Act with particulars of the risks which the activity may give rise to.
sv: § Den som driver verksamhet på byggarbetsplatsen ska till byggarbetsmiljösamordnaren enligt 7 b § arbetsmiljölagen lämna uppgift om de risker som kan uppstå på grund av denna verksamhet.

source: All persons active at the construction site shall comply with the rules of order and safety which are issued by the co-ordinator and shall take part in the safety activities at the construction site.
sv: Alla som är verksamma på byggarbetsplatsen ska följa de ordnings- och skyddsregler som denne byggarbetsmiljösamordnare utfärdar och delta i byggarbetsplatsens arbetsmiljöarbete.

source: Section 18
sv: (AFS 2008:16)

source: The persons carrying on activities at the common worksite shall help to maintain good order and to ensure that the construction site is not unnecessarily encumbered with materials, equipment, packaging, refuse and suchlike.
sv: § De som driver verksamhet på det gemensamma arbetsstället skall medverka till att god ordning råder och att byggarbetsplatsen inte onödigtvis belamras med material, redskap, emballage, avfall och liknande.

source: Cleaning shall be carried out periodically.
sv: Regelbunden städning skall utföras.

source: Planning and setting up of a place or area for building or civil engineering work
sv: Planering samt anordnande av plats eller område för byggnads- eller anläggningsarbete

source: Health hazards and accident risks involved by the work shall be assessed as early as possible.
sv: Riskerna för ohälsa och olycksfall i arbetet skall bedömas så tidigt som möjligt.

source: Particular account shall be taken of the risk of fire breaking out and spreading.
sv: Risken för uppkomst och spridning av brand skall särskilt uppmärksammas.

source: When choosing the location of workstations, it shall be borne in mind how access to these workplaces is obtained and how routes for communication and access can be arranged.
sv: När platser för arbetets utförande väljs skall hänsyn tas till möjligheterna till tillträde samt till hur förbindelse- och tillträdesleder dit kan ordnas.

source: The workers shall be provided with drinking water near the work stations.
sv: Arbetstagarna skall ha tillgång till dricksvatten i närheten av arbetsplatserna.

source: The period allocated for different types of work and work stages shall be adapted to progress made on the site.
sv: Tidstilldelningen för olika arbeten och arbetsmoment skall anpassas med hänsyn till hur arbetet fortskrider.

source: Existing overhead electric power lines which can constitute a risk to health or safety shall, if possible, be redirected away from the construction site or the current cut off.
sv: Befintliga elektriska luftledningar, som kan utgöra risk för hälsa eller säkerhet, skall om möjligt ledas förbi byggarbetsplatsen eller göras spänningslösa.

source: If this is not possible, barriers and notices shall be put up to ensure that equipment and vehicles are kept at such a distance that the overhead electric power lines will not endanger health or safety.
sv: Om detta inte är möjligt skall avspärrningar och varningsskyltar sättas upp så att utrustning och fordon hålls på sådant avstånd att luftledningarna inte utgör någon risk för hälsa eller säkerhet.

source: Signs shall be erected in suitable locations round a construction site and in its immediate vicinity.
sv: Runt en byggarbetsplats och i dess omedelbara närhet skall det finnas skyltar på lämpliga platser.

source: Installations, cables or other distribution systems for electricity, gas and water
sv: Installationer och ledningar för el, gas och vatten

source: Such items shall be identified, inspected and clearly marked so that the risks associated with them will be reduced to a minimum.
sv: Sådana installationer eller ledningar skall identifieras, kontrolleras och tydligt utmärkas så att de risker som är förbundna med dem nedbringas till ett minimum.

source: Any such installations shall be designed and located so as to be protected from inadvertent influence.
sv: Sådan anläggning skall utformas och placeras så att den är skyddad för oavsiktlig påverkan.

source: Reception and storage spaces
sv: AFS 1999:3 12

source: Section 26
sv: Mottagnings- och lagringsutrymmen

source: Sufficient space shall be provided, to the extent necessary, for the reception, storage and safe keeping of building products and other materials used in the work.
sv: § I den utsträckning som behövs skall det finnas tillräcklig plats för mottagning, lagring och förvaring av byggprodukter och annat material som används i arbetet.

source: An area for the keeping of dangerous substances shall be demarcated and laid out in such a way that health hazards and accident risks are averted.
sv: Utrymme för förvaring av farliga ämnen skall avgränsas och utformas så att risk för ohälsa och olycksfall är förebyggd.

source: Areas and surfaces for reception or storage shall have sufficient bearing capacity and stability to avert the risk of collapses.
sv: Utrymmen och ytor för mottagning eller lagring skall ha sådan stabilitet och bärighet att risken för ras är förebyggd.

source: Evacuation
sv: Utrymning

source: All employees shall be able to reach a safe area quickly and safely.
sv: Alla arbetstagare skall snabbt och säkert kunna nå säkert område.

source: Specific escape routes and assembly points shall be marked with signs.
sv: Särskilt anordnade utrymningsvägar samt återsamlingsplatser skall markeras med skyltar.

source: The signs shall be sufficiently resistant and be placed at appropriate points.
sv: Dessa skyltar skall vara tillräckligt hållbara och placeras på lämpliga platser.

source: Escape routes requiring illumination shall be provided with emergency lighting of adequate intensity in case the ordinary lighting fails.
sv: Utrymningsvägar som kräver belysning skall ha nödbelysning med tillräcklig styrka i händelse av fel på ordinarie belysning.

source: They must not be so locked or fastened that they cannot be easily and immediately opened by any person who may require to use them in an emergency.
sv: De får inte vara låsta eller reglade på ett sätt som hindrar att de lätt och omedelbart kan öppnas av vem som helst som kan behöva använda dem i en nödsituation.

source: Doors and gates on escape routes shall be appropriately marked.
sv: Dörrar och portar utmed utrymningsvägar skall markeras på lämpligt sätt.

source: Sliding or revolving doors must not be used as doors on specific escape routes.
sv: Skjutdörrar eller rotérdörrar får inte förekomma som dörrar i särskilt anordnade utrymningsvägar.

source: First Aid
sv: Första hjälpen

source: Staff trained to provide first aid shall be available if called upon, at any time.
sv: Personal som är utbildad att ge första hjälpen skall alltid kunna tillkallas.

source: Areas or places for first aid shall be provided to the extent appropriate to the nature and scale of the activity.
sv: I den utsträckning som motiveras av verksamhetens art och omfattning skall det finnas utrymmen för första hjälpen.

source: Equipment and areas or places for first aid shall be signposted.
sv: Utrustning och utrymmen för första hjälpen skall vara utmärkta med skyltar.

source: The addresses and telephone numbers of ambulance and rescue services shall normally be clearly displayed.
sv: Anslag med adress och telefonnummer till ambulans och räddningstjänst skall normalt finnas väl synligt.

source: Fire detectors and alarm systems
sv: Branddetektorer och alarmsystem

source: Fire-fighting equipment and, where needed, fire detectors and alarm systems shall be provided.
sv: Brandredskap och vid behov branddetektorer och alarmsystem skall finnas.

source: Their number and design shall be adapted to:
sv: De skall till antal och utformning vara anpassade till

source: the conditions where the building or civil engineering work is carried out,
sv: förhållandena där byggnads- eller anläggningsarbetet utförs,

source: the size and use of the spaces,
sv: utrymmenas storlek och användning,

source: the equipment used,
sv: den utrustning som används,

source: the physical and chemical properties of the building products and substances occurring, and the maximum potential number of people present in the spaces and work premises and on the construction site.
sv: byggprodukternas och förekommande ämnens fysikaliska och kemiska egenskaper samt det största antal människor som samtidigt kan vistas i utrymmena och arbetslokalerna och på byggarbetsplatsen.

source: Appropriate tests and drills shall take place at regular intervals.
sv: Lämpliga provningar och övningar skall genomföras regelbundet.

source: The equipment shall be indicated by signs.
sv: Plats för brandredskap skall utmärkas med skyltar.

source: Doors, gates, windows and walls
sv: Dörrar, portar, fönster och väggar
